tortoisecatfish/nrf52-custom-ble-template/ble_app_template/ble_cus.c
#include <string.h>

#include "sdk_common.h"
#include "ble_cus.h"
#include "ble_srv_common.h"
#include "nrf_gpio.h"
#include "boards.h"
#include "nrf_log.h"

volatile uint8_t intensity_data_received;
volatile uint8_t HILF_pulse_width_data_received = 0;
volatile uint8_t HILF_period_data_received      = 0;
volatile uint8_t LIHF_period_data_received      = 0;

/**@brief Function for handling the Connect event.
 *
 * @param[in]   p_cus       Custom Service structure.
 * @param[in]   p_ble_evt   Event received from the BLE stack.
 */
static void on_connect(ble_cus_t * p_cus, ble_evt_t const * p_ble_evt)
{
    p_cus->conn_handle = p_ble_evt->evt.gap_evt.conn_handle;

    ble_cus_evt_t evt;

    evt.evt_type = BLE_CUS_EVT_CONNECTED;

    p_cus->evt_handler(p_cus, &evt);
}

/**@brief Function for handling the Disconnect event.
 *
 * @param[in]   p_cus       Custom Service structure.
 * @param[in]   p_ble_evt   Event received from the BLE stack.
 */
static void on_disconnect(ble_cus_t * p_cus, ble_evt_t const * p_ble_evt)
{
    UNUSED_PARAMETER(p_ble_evt);
    p_cus->conn_handle = BLE_CONN_HANDLE_INVALID;
    
    ble_cus_evt_t evt;

    evt.evt_type = BLE_CUS_EVT_DISCONNECTED;

    p_cus->evt_handler(p_cus, &evt);
}

/**@brief Function for handling the Write event.
 *
 * @param[in]   p_cus       Custom Service structure.
 * @param[in]   p_ble_evt   Event received from the BLE stack.
 */
static void on_write(ble_cus_t * p_cus, ble_evt_t const * p_ble_evt)
{
    ble_gatts_evt_write_t const * p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;
    ble_cus_evt_t evt;
    // Custom Value Characteristic Written to.
    if (p_evt_write->handle == p_cus->intensity_value_handles.value_handle)
    {
        NRF_LOG_INFO("Intensity Value is received. The current value received is 0x%x \r\n", * p_evt_write -> data);
//         nrf_gpio_pin_toggle(LED_4);
        if(*p_evt_write->data == 0x00)
        {
            evt.evt_type = BLE_CUS_EVT_GOTO_IDLE;
//             nrf_gpio_pin_clear(20);
        }
        else if(*p_evt_write->data == 0xFF)
        {
            evt.evt_type = BLE_CUS_EVT_GOTO_SLEEP;
//             nrf_gpio_pin_set(20);
        }
        else
        {
            evt.evt_type = BLE_CUS_EVT_GOTO_ACTIVE;
            intensity_data_received    = * p_evt_write->data;
          //Do nothing
        }
    } else if (p_evt_write->handle == p_cus->HILF_pw_value_handles.value_handle) {
        NRF_LOG_INFO("Pulse Width of the High Intensity Low Frequency signal is received. The value is %d \n", * p_evt_write -> data);

        HILF_pulse_width_data_received = * p_evt_write -> data;
        evt.evt_type = BLE_CUS_EVT_TIMER_UPDATE;
    } else if (p_evt_write->handle == p_cus->HILF_period_value_handles.value_handle) {
        NRF_LOG_INFO("Period of the High Intensity Low Frequency signal is received. The value is %d \n", * p_evt_write -> data);

        HILF_period_data_received      = * p_evt_write -> data;
        evt.evt_type = BLE_CUS_EVT_TIMER_UPDATE;
    } else if (p_evt_write->handle == p_cus->LIHF_period_value_handles.value_handle) {
        NRF_LOG_INFO("Period of the Low Intensity High Frequency signal is received. The value is %d \n", * p_evt_write -> data);

        LIHF_period_data_received      = * p_evt_write -> data;
        evt.evt_type = BLE_CUS_EVT_TIMER_UPDATE;
    }

    p_cus->evt_handler(p_cus, &evt);

    // Check if the Custom value CCCD is written to and that the value is the appropriate length, i.e 2 bytes.
    if ((p_evt_write->handle == p_cus->intensity_value_handles.cccd_handle)
        && (p_evt_write->len == 2)
       )
    {
        // CCCD written, call application event handler
        if (p_cus->evt_handler != NULL)
        {
            ble_cus_evt_t evt;

            if (ble_srv_is_notification_enabled(p_evt_write->data))
            {
                evt.evt_type = BLE_CUS_EVT_NOTIFICATION_ENABLED;
            }
            else
            {
                evt.evt_type = BLE_CUS_EVT_NOTIFICATION_DISABLED;
            }
            // Call the application event handler.
            p_cus->evt_handler(p_cus, &evt);
        }
    }

}

void ble_cus_on_ble_evt( ble_evt_t const * p_ble_evt, void * p_context)
{
    ble_cus_t * p_cus = (ble_cus_t *) p_context;
    
    NRF_LOG_INFO("BLE event received. Event type = %d\r\n", p_ble_evt->header.evt_id); 
    if (p_cus == NULL || p_ble_evt == NULL)
    {
        return;
    }
    
    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            on_connect(p_cus, p_ble_evt);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            on_disconnect(p_cus, p_ble_evt);
            break;

        case BLE_GATTS_EVT_WRITE:
            on_write(p_cus, p_ble_evt);
            break;
/* Handling this event is not necessary
        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
            NRF_LOG_INFO("EXCHANGE_MTU_REQUEST event received.\r\n");
            break;
*/
        default:
            // No implementation needed.
            break;
    }
}

/**@brief Function for adding the Custom Value characteristic.
 *
 * @param[in]   p_cus        Battery Service structure.
 * @param[in]   p_cus_init   Information needed to initialize the service.
 *
 * @return      NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t custom_value_char_add(ble_cus_t * p_cus, const ble_cus_init_t * p_cus_init)
{
    uint32_t            err_code;
    ble_gatts_char_md_t char_md;
    ble_gatts_attr_md_t cccd_md;
    ble_gatts_attr_t    attr_intensity_value;
    ble_gatts_attr_t    attr_HILF_pw_value;
    ble_gatts_attr_t    attr_HILF_period_value;
    ble_gatts_attr_t    attr_LIHF_period_value;

    ble_uuid_t          intensity_char_uuid;
    ble_uuid_t          HILF_pw_char_uuid;
    ble_uuid_t          HILF_period_char_uuid;
    ble_uuid_t          LIHF_period_char_uuid;

    ble_gatts_attr_md_t attr_md;

    // Add Custom Value characteristic
    memset(&cccd_md, 0, sizeof(cccd_md));

    //  Read  operation on cccd should be possible without authentication.
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);
    
    cccd_md.write_perm = p_cus_init->custom_value_char_attr_md.cccd_write_perm;
    cccd_md.vloc       = BLE_GATTS_VLOC_STACK;

    memset(&char_md, 0, sizeof(char_md));

    char_md.char_props.read    = 1;
    char_md.char_props.write   = 1;
    char_md.char_props.notify  = 1;
    char_md.p_char_user_desc   = NULL;
    char_md.p_char_pf          = NULL;
    char_md.p_user_desc_md     = NULL;
    char_md.p_cccd_md          = &cccd_md;
    char_md.p_sccd_md          = NULL;
		
    intensity_char_uuid.type   = p_cus->uuid_type;
    intensity_char_uuid.uuid   = INTENSITY_VALUE_CHAR_UUID;

    HILF_pw_char_uuid.type     = p_cus->uuid_type;
    HILF_pw_char_uuid.uuid     = HILF_PW_VALUE_CHAR_UUID;

    HILF_period_char_uuid.type = p_cus->uuid_type;
    HILF_period_char_uuid.uuid = HILF_PERIOD_VALUE_CHAR_UUID;

    LIHF_period_char_uuid.type = p_cus->uuid_type;
    LIHF_period_char_uuid.uuid = LIHF_PERIOD_VALUE_CHAR_UUID;

    memset(&attr_md, 0, sizeof(attr_md));

    attr_md.read_perm  = p_cus_init->custom_value_char_attr_md.read_perm;
    attr_md.write_perm = p_cus_init->custom_value_char_attr_md.write_perm;
    attr_md.vloc       = BLE_GATTS_VLOC_STACK;
    attr_md.rd_auth    = 0;
    attr_md.wr_auth    = 0;
    attr_md.vlen       = 0;

    memset(&attr_intensity_value,   0, sizeof(attr_intensity_value  ));

    attr_intensity_value.p_uuid      = &intensity_char_uuid;
    attr_intensity_value.p_attr_md   = &attr_md;
    attr_intensity_value.init_len    = sizeof(uint8_t);
    attr_intensity_value.init_offs   = 0;
    attr_intensity_value.max_len     = sizeof(uint8_t);

    memset(&attr_HILF_pw_value,     0, sizeof(attr_HILF_pw_value    ));

    attr_HILF_pw_value.p_uuid        = &HILF_pw_char_uuid;
    attr_HILF_pw_value.p_attr_md     = &attr_md;
    attr_HILF_pw_value.init_len      = sizeof(uint8_t);
    attr_HILF_pw_value.init_offs     = 0;
    attr_HILF_pw_value.max_len       = sizeof(uint8_t);

    memset(&attr_HILF_period_value, 0, sizeof(attr_HILF_period_value));

    attr_HILF_period_value.p_uuid    = &HILF_period_char_uuid;
    attr_HILF_period_value.p_attr_md = &attr_md;
    attr_HILF_period_value.init_len  = sizeof(uint16_t);
    attr_HILF_period_value.init_offs = 0;
    attr_HILF_period_value.max_len   = sizeof(uint16_t);

    memset(&attr_LIHF_period_value, 0, sizeof(attr_LIHF_period_value));

    attr_LIHF_period_value.p_uuid    = &LIHF_period_char_uuid;
    attr_LIHF_period_value.p_attr_md = &attr_md;
    attr_LIHF_period_value.init_len  = sizeof(uint8_t);
    attr_LIHF_period_value.init_offs = 0;
    attr_LIHF_period_value.max_len   = sizeof(uint8_t);

    err_code = sd_ble_gatts_characteristic_add(p_cus->service_handle, &char_md,
                                               &attr_intensity_value,
                                               &p_cus->intensity_value_handles  );

    err_code = sd_ble_gatts_characteristic_add(p_cus->service_handle, &char_md,
                                               &attr_HILF_pw_value,
                                               &p_cus->HILF_pw_value_handles    );

    err_code = sd_ble_gatts_characteristic_add(p_cus->service_handle, &char_md,
                                               &attr_HILF_period_value,
                                               &p_cus->HILF_period_value_handles);

    err_code = sd_ble_gatts_characteristic_add(p_cus->service_handle, &char_md,
                                               &attr_LIHF_period_value,
                                               &p_cus->LIHF_period_value_handles);

    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    return NRF_SUCCESS;
}

uint32_t ble_cus_init(ble_cus_t * p_cus, const ble_cus_init_t * p_cus_init)
{
    if (p_cus == NULL || p_cus_init == NULL)
    {
        return NRF_ERROR_NULL;
    }

    uint32_t   err_code;
    ble_uuid_t ble_uuid;

    // Initialize service structure
    p_cus->evt_handler               = p_cus_init->evt_handler;
    p_cus->conn_handle               = BLE_CONN_HANDLE_INVALID;

    // Add Custom Service UUID
    ble_uuid128_t base_uuid = {CUSTOM_SERVICE_UUID_BASE};
    err_code =  sd_ble_uuid_vs_add(&base_uuid, &p_cus->uuid_type);
    VERIFY_SUCCESS(err_code);
    
    ble_uuid.type = p_cus->uuid_type;
    ble_uuid.uuid = CUSTOM_SERVICE_UUID;

    // Add the Custom Service
    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, &ble_uuid, &p_cus->service_handle);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    // Add Custom Value characteristic
    return custom_value_char_add(p_cus, p_cus_init);
}

uint32_t ble_cus_custom_value_update(ble_cus_t * p_cus, uint8_t custom_value)
{
    NRF_LOG_INFO("In ble_cus_custom_value_update. \r\n"); 
    if (p_cus == NULL)
    {
        return NRF_ERROR_NULL;
    }

    uint32_t err_code = NRF_SUCCESS;
    ble_gatts_value_t gatts_value;

    // Initialize value struct.
    memset(&gatts_value, 0, sizeof(gatts_value));

    gatts_value.len     = sizeof(uint16_t);
    gatts_value.offset  = 0;
    gatts_value.p_value = &custom_value;

    // Update database.
    err_code = sd_ble_gatts_value_set(p_cus->conn_handle,
                                      p_cus->intensity_value_handles.value_handle,
                                      &gatts_value);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    // Send value if connected and notifying.
    if ((p_cus->conn_handle != BLE_CONN_HANDLE_INVALID)) 
    {
        ble_gatts_hvx_params_t hvx_params;

        memset(&hvx_params, 0, sizeof(hvx_params));

        hvx_params.handle = p_cus->intensity_value_handles.value_handle;
        hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
        hvx_params.offset = gatts_value.offset;
        hvx_params.p_len  = &gatts_value.len;
        hvx_params.p_data = gatts_value.p_value;

        err_code = sd_ble_gatts_hvx(p_cus->conn_handle, &hvx_params);
        NRF_LOG_INFO("sd_ble_gatts_hvx result: %x. \r\n", err_code); 
    }
    else
    {
        err_code = NRF_ERROR_INVALID_STATE;
        NRF_LOG_INFO("sd_ble_gatts_hvx result: NRF_ERROR_INVALID_STATE. \r\n"); 
    }


    return err_code;
}
